Revit 2024 API
gbXMLBuildingOperatingSchedule Enumeration
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum gbXMLBuildingOperatingSchedule
Visual Basic
Public Enumeration gbXMLBuildingOperatingSchedule
Visual C++
public enum class gbXMLBuildingOperatingSchedule
Members
Member name | Description
DefaultOperatingSchedule
TwentyFourHourSevenDayFacility
TwentyFourHourHourSixDayFacility
TwentyFourHourHourFiveDayFacility
TwelveHourSevenDayFacility
TwelveHourSixDayFacility
TwelveHourFiveDayFacility
KindergartenThruTwelveGradeSchool
YearRoundSchool
TheaterPerformingArts
Worship
NoOfOperatingScheduleEnums
Remarks
 This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the building operating schedule.
See Also
Autodesk.Revit.DB.Analysis Namespace